function y = checkloop(input1)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%---------检验输入矩阵的各行是否与其他行存在度为4的环----------%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%% A 初始化相关参数 %%%%%%%%%%%%%%%%%%%%%%%%%%%
A = input1;
[Am,An] = size(A);
flag = zeros(Am,1);%无度为4的圈的标志位

%%%%%%%%%%%%%%%%%%%% B 检验是否有度为4的环 %%%%%%%%%%%%%%%%%%%%%%%
for i = 1:Am;
    mid = 0;
    for j = 1:Am;
        if j~=i;% 与输入矩阵其他各行的比较
            if sum(A(i,:).*A(j,:)) >= 2;% 如果有圈
               mid = mid + 1;
            end;
        end;
    end;
    flag(i,1) = mid;
end;
y = flag;
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 输出flag的第i个元素的值表示该行与其他各行存在度为4的圈个数,当没有圈时,i的值应该为0